# Инструменты для создания виртуального окружения (ИСР1)

## Устанавливаемые отдельно

## virtualenv

Один из самых популярных инструментов, позволяющих создавать виртуальные окружения. Он прост в установке и использовании, по нему имеется довольно много руководств. Чаще всего описание развертывания и использования многих систем, созданных с использованием Python включает в себя процесс создания виртуального окружения с помощью virtualenv.

## pyenv

Инструмент для изоляции версий Python. Чаще всего применяется, когда на одной машине необходимо иметь несколько версий интерпретатора для тестирования на них разрабатываемого вами ПО.

## virtualenvwrapper

Обёртка для virtualenv, позволяющая хранить все изолированные окружения в одном месте, создавать их, копировать и удалять. Предоставляет удобный способ переключения между окружениями и возможность расширять функционал за счёт плагинов.

Входящие в стандартную библиотеку Python

## venv

Аналог virtualenv для Python3, не может быть использован на Python2.

Создание виртуального окружения: python -m venv

Активация виртуального окружения: source /bin/activate для Linux \Scripts\activate.bat для Windows

Деактивация виртуального окружения: deactivate

# ИСР2

установка - pip install virtualenv

создание виртуального окружения с именем env - virtualenv env

активация виртуального окружения - env\Scripts\activate

деактивация виртуального окружения - deactivate

версия виртуального окружения и его расположени - --version
